In [1]:
import pandas as pd

In [3]:
!pip3 install pandas

Looking in indexes: https://pypi.tuna.tsinghua.edu.cn/simple
Collecting pandas
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/04/8b/a1d5f257bfee6aab440e763505c65368bbf713309c9dc70ceeb8d4677c2e/pandas-0.24.2-cp37-cp37m-win32.whl (7.7MB)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from pandas) (2.8.0)
Collecting pytz>=2011k (from pandas)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/3d/73/fe30c2daaaa0713420d0382b16fbb761409f532c56bdcc514bf7b6262bb6/pytz-2019.1-py2.py3-none-any.whl (510kB)
Requirement already satisfied: numpy>=1.12.0 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from pandas) (1.16.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-0.24.2 pytz-2019.1

In [5]:
obj = pd.Series([4,7,5,3])

In [6]:
obj

0    4
1    7
2    5
3    3
dtype: int64

In [7]:
obj.values

array([4, 7, 5, 3], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
import numpy as np

In [19]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
sdata	=	{'Ohio':	35000,	'Texas':	71000,	'Oregon':	16000, 'Utah':5000}

In [22]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
obj3 = pd.Series(sdata)

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [27]:
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'

In [32]:
obj4.index.name = 'state'

In [33]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2    5
3    3
dtype: int64

In [36]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff     5
Ryan     3
dtype: int64

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
pd.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [41]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [42]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [45]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [49]:
frame['debt'] = 0.5

In [50]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.5
1    Ohio  2001  1.7   0.5
2    Ohio  2002  3.6   0.5
3  Nevada  2001  2.4   0.5
4  Nevada  2002  2.9   0.5
5  Nevada  2003  3.2   0.5

In [51]:
frame2['debt'] = np.arange(6.)

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [53]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [54]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [56]:
del frame2['eastern']

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [58]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [59]:
frame3 = pd.DataFrame(pop)

In [60]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [61]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [62]:
pd.DataFrame(pop,index = [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [63]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [64]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [65]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [66]:
frame3.index.name = 'year'

In [67]:
frame3.columns.name = 'state'

In [68]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [72]:
frame3.values[0,0].dtype

dtype('float64')

In [74]:
np.nan

nan

In [75]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [76]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [77]:
index = obj.index;index

Index(['a', 'b', 'c'], dtype='object')

In [78]:
index[1:]

Index(['b', 'c'], dtype='object')

In [79]:
index[1]=1

TypeError: Index does not support mutable operations

In [80]:
labels = pd.Index(np.arange(3))

In [81]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [82]:
obj3 = pd.Series([1.5,-2.5,0],index = labels)

In [84]:
obj3.index

Int64Index([0, 1, 2], dtype='int64')

In [85]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [87]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [88]:
'Ohio' in frame3.columns

True

In [89]:
1 in frame3.columns

False

In [90]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [91]:
%ImportError

UsageError: Line magic function `%ImportError` not found.

In [92]:
obj3

0    1.5
1   -2.5
2    0.0
dtype: float64

In [95]:
obj3.index = [6,5,4]

In [96]:
obj3

6    1.5
5   -2.5
4    0.0
dtype: float64

## Essential Functionality

In [97]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [98]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [99]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [100]:
obj3 = pd.Series(['bule', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      bule
2    purple
4    yellow
dtype: object

In [101]:
obj3.reindex(range(6), method='ffill')

0      bule
1      bule
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [102]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [103]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [104]:
frame2 = frame.reindex(['a','b','c','d'])

In [105]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [106]:
states = ['Texas', 'Utah', 'California']

In [107]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [108]:
frame.loc[['a', 'b', 'c', 'd'], states]

c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [110]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [111]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [112]:
new_obj = obj.drop('c')

In [113]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [114]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [115]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [116]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data.drop('one',axis = 1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [120]:
data.drop(['two','four'],axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [121]:
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
obj['b']

1.0

In [124]:
obj[1]

1.0

In [125]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [128]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [129]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [130]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [131]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [132]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [134]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [135]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [136]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [138]:
data[data<5]=0

In [140]:

data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [141]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [142]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [143]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [144]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [145]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [146]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [147]:
ser = pd.Series(np.arange(3.))

In [148]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [149]:
ser[-1]

KeyError: -1

In [150]:
ser[1]

1.0

In [151]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [154]:
ser2.iloc[:1]

a    0.0
dtype: float64

In [155]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [156]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [157]:
s2

a    2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [158]:
s1+s2

a    9.4
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [159]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [160]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [161]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [162]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [163]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [164]:
df1

   A
0  1
1  2

In [165]:
df2

   B
0  3
1  4

In [166]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [167]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), 
                   columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), 
                   columns=list('abcde'))

df2.loc[1, 'b'] = np.nan

In [168]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [169]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [170]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [173]:
df1.radd(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [174]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [175]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [176]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [177]:
arr[0]

array([0., 1., 2., 3.])

In [178]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [179]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [180]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [181]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [182]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [183]:
series.index = ['b','e','f']

In [184]:
frame - series

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [185]:
series3 = frame['d']

In [186]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [189]:
frame.sub(series3)#,axis='index')

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [190]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), 
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.803051 -1.142005 -1.316195
Ohio   -0.741582  1.074479  0.170086
Texas   0.943535 -1.633045  1.096077
Oregon -0.926125 -1.072267 -0.215828

In [191]:
np.abs(frame)

               b         d         e
Utah    1.803051  1.142005  1.316195
Ohio    0.741582  1.074479  0.170086
Texas   0.943535  1.633045  1.096077
Oregon  0.926125  1.072267  0.215828

In [192]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.746586
d    2.707524
e    2.412272
dtype: float64

In [193]:
frame.apply(f, axis='columns')

Utah      0.661046
Ohio      1.816061
Texas     2.729123
Oregon    0.856440
dtype: float64

In [194]:
def f(x): 
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [195]:
frame

               b         d         e
Utah   -1.803051 -1.142005 -1.316195
Ohio   -0.741582  1.074479  0.170086
Texas   0.943535 -1.633045  1.096077
Oregon -0.926125 -1.072267 -0.215828

In [196]:
frame.apply(f)

            b         d         e
min -1.803051 -1.633045 -1.316195
max  0.943535  1.074479  1.096077

In [197]:
format = lambda x: '%.2f' % x

In [198]:
frame.applymap(format)

            b      d      e
Utah    -1.80  -1.14  -1.32
Ohio    -0.74   1.07   0.17
Texas    0.94  -1.63   1.10
Oregon  -0.93  -1.07  -0.22

In [199]:
frame['e'].map(format)

Utah      -1.32
Ohio       0.17
Texas      1.10
Oregon    -0.22
Name: e, dtype: object

In [200]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [201]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [202]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [203]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [204]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [205]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [206]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [207]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [208]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [209]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [210]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [211]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [212]:
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [213]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [214]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [215]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [216]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [217]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [218]:
frame.rank(axis='columns') # columns表示列与列之间的排序（即每一行里数据间的排序）

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [219]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [220]:
obj.index.is_unique

False

In [221]:
obj['a']

a    0
a    1
dtype: int64

In [222]:
obj['c']

4

In [223]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.225159  0.370994 -0.458743
a  0.980933  2.169885  0.445016
b  0.318374  1.453668  1.108190
b -0.234358  0.193032 -0.582382

In [224]:
df.loc['b']

          0         1         2
b  0.318374  1.453668  1.108190
b -0.234358  0.193032 -0.582382

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [11]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [13]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [14]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [15]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [16]:
import pandas_datareader.data as web

In [18]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

volumn = pd.DataFrame({ticker: data['Volumn']
                       for ticker, data in all_data.items()})

KeyError: 'Volumn'

In [19]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [20]:
uniques = obj.unique()

In [24]:
uniques.sort()

In [25]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [26]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [27]:
pd.value_counts(obj.values,sort=False)

b    2
d    1
a    3
c    3
dtype: int64

In [28]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [29]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [30]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [31]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

In [32]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int32)

In [33]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [34]:
result = data.apply(pd.value_counts)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [35]:
!cat

'cat' 不是内部或外部命令，也不是可运行的程序
或批处理文件。

In [39]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [40]:
df = pd.read_csv('examples\ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
pd.read_table('examples\ex1.csv',sep = ',')

c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [43]:
df = pd.read_csv('examples\ex2.csv',header = None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [44]:
pd.read_csv('examples\ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
parsed = pd.read_csv('examples/ex3.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [46]:
list = ['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [49]:
str(list)

"['            A         B         C\\n', 'aaa -0.264438 -1.026059 -0.619500\\n', 'bbb  0.927272  0.302904 -0.032399\\n', 'ccc -0.264273 -0.386314 -0.217601\\n', 'ddd -0.871858 -0.348382  1.100491\\n']"

In [52]:
with open('examples\ex4.txt','w') as f:
   for l in list:
    f.write(l)

In [53]:
!type examples\ex4.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [56]:
result = pd.read_table('examples\ex4.txt', sep='\s+')
result

c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [57]:
pd.read_csv('examples\ex5.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [66]:
result = pd.read_csv('examples\ex6.csv',na_values = sentinels)
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [67]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1       True  False  False   True  False    False
2      False  False  False  False  False     True

In [68]:
sentinels = {'message': ['foo', 'NA'],
             'something': ['two']}

In [69]:
pd

In [70]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [71]:
data.to_csv('examples/out.csv')

In [73]:
!type examples\out.csv

,Qu1,Qu2,Qu3
0,1,2,1
1,3,3,5
2,4,1,2
3,3,2,4
4,4,3,4

In [74]:
import sys

In [75]:
data.to_csv(sys.stdout, sep = '|')

|Qu1|Qu2|Qu3
0|1|2|1
1|3|3|5
2|4|1|2
3|3|2|4
4|4|3|4

In [76]:
data.to_csv(sys.stdout, sep = '-',index = False, header = False)

1-2-1
3-3-5
4-1-2
3-2-4
4-3-4

In [77]:
data.to_csv(sys.stdout, index=False, columns=['Qu2', 'Qu1'])

Qu2,Qu1
2,1
3,3
1,4
2,3
3,4

In [78]:
obj = """ 
{"name": "Wes", 
 "places_lived": ["United States", "Spain", "Germany"], 
 "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, 
                           {"name": "Katie", "age": 38, 
                            "pets": ["Sixes", "Stache", "Cisco"]}] 
} 
"""

In [79]:
import json

In [80]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [81]:
asjson = json.dumps(result)

In [82]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [84]:
!pip install beautifulsoup4 html5lib

Looking in indexes: https://pypi.tuna.tsinghua.edu.cn/simple
Collecting beautifulsoup4
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/1d/5d/3260694a59df0ec52f8b4883f5d23b130bc237602a1411fa670eae12351e/beautifulsoup4-4.7.1-py3-none-any.whl (94kB)
Collecting html5lib
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/a5/62/bbd2be0e7943ec8504b517e62bab011b4946e1258842bc159e5dfde15b96/html5lib-1.0.1-py2.py3-none-any.whl (117kB)
Collecting soupsieve>=1.2 (from beautifulsoup4)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/b9/a5/7ea40d0f8676bde6e464a6435a48bc5db09b1a8f4f06d41dd997b8f3c616/soupsieve-1.9.1-py2.py3-none-any.whl
Requirement already satisfied: webencodings in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from html5lib) (1.12.0)
Installing collected packages: soupsieve, beautifulsoup4, html5lib
Successfully installed beautifulsoup4-4.7.1 html5lib-1.0.1 soupsieve-1.9.1

In [85]:
frame = pd.read_csv('examples\ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [88]:
pd.to_pickle(frame,'examples//frame_pickle')

In [90]:
pd.read_pickle('examples//frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [99]:
frame = pd.DataFrame({'a': np.random.randn(100)})
import tables
store = pd.HDFStore('examples//mydata.h5')

In [93]:
np.random.randn()

0.6719081270695748

In [98]:
frame.to_excel('examples\out.xlsx')

In [97]:
!pip install tables

Looking in indexes: https://pypi.tuna.tsinghua.edu.cn/simple
Collecting tables
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/0d/12/244e2285be2928a2c5f5b9641cf2e051f5a012be72291d2ab72f8b530085/tables-3.5.1-cp37-cp37m-win32.whl (2.9MB)
Requirement already satisfied: numpy>=1.9.3 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from tables) (1.16.3)
Requirement already satisfied: six>=1.9.0 in c:\users\admin\appdata\local\programs\python\python37-32\lib\site-packages (from tables) (1.12.0)
Collecting mock>=2.0 (from tables)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/05/d2/f94e68be6b17f46d2c353564da56e6fb89ef09faeeff3313a046cb810ca9/mock-3.0.5-py2.py3-none-any.whl
Collecting numexpr>=2.6.2 (from tables)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/57/fa/42bd32b268f4a724550b2e5979c97e2643c85485aa5a4dcce13a67f42b95/numexpr-2.6.9-cp37-none-win32.whl (90kB)
Installing collected packages: mock, numexpr, tables
Successfully installed mock-3.0.5 numexpr-2.6.9 tables-3.5.1

In [100]:
import requests

In [101]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [103]:
resp = requests.get(url)
resp

In [104]:
data=resp.json()

In [107]:
data[1]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26385',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26385/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26385/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26385/events',
 'html_url': 'https://github.com/pandas-dev/pandas/issues/26385',
 'id': 443724517,
 'node_id': 'MDU6SXNzdWU0NDM3MjQ1MTc=',
 'number': 26385,
 'title': 'GroupBy nth ignores observed keyword for Categorical',
 'user': {'login': 'WillAyd',
  'id': 609873,
  'node_id': 'MDQ6VXNlcjYwOTg3Mw==',
  'avatar_url': 'https://avatars0.githubusercontent.com/u/609873?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/WillAyd',
  'html_url': 'https://github.com/WillAyd',
  'followers_url': 'https://api.github.com/users/WillAyd/followers',
  'following_url': 'https://api.github.com/users/WillAyd/following{/other_user}',
  'gists_url': 'https://api.github.com/users/WillAyd/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/WillAyd/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/WillAyd/subscriptions',
  'organizations_url': 'https://api.github.com/users/WillAyd/orgs',
  'repos_url': 'https://api.github.com/users/WillAyd/repos',
  'events_url': 'https://api.github.com/users/WillAyd/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/WillAyd/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 78527356,
   'node_id': 'MDU6TGFiZWw3ODUyNzM1Ng==',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Categorical',
   'name': 'Categorical',
   'color': 'e11d21',
   'default': False},
  {'id': 233160,
   'node_id': 'MDU6TGFiZWwyMzMxNjA=',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Groupby',
   'name': 'Groupby',
   'color': '729FCF',
   'default': False},
  {'id': 2822342,
   'node_id': 'MDU6TGFiZWwyODIyMzQy',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Missing-data',
   'name': 'Missing-data',
   'color': 'd7e102',
   'default': False}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': {'url': 'https://api.github.com/repos/pandas-dev/pandas/milestones/32',
  'html_url': 'https://github.com/pandas-dev/pandas/milestone/32',
  'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/milestones/32/labels',
  'id': 933188,
  'node_id': 'MDk6TWlsZXN0b25lOTMzMTg4',
  'number': 32,
  'title': 'Contributions Welcome',
  'description': 'Changes that would be nice to have in the next release. These issues are not blocking. They will be pushed to the next release if no one has time to fix them.',
  'creator': {'login': 'jreback',
   'id': 953992,
   'node_id': 'MDQ6VXNlcjk1Mzk5Mg==',
   'avatar_url': 'https://avatars2.githubusercontent.com/u/953992?v=4',
   'gravatar_id': '',
   'url': 'https://api.github.com/users/jreback',
   'html_url': 'https://github.com/jreback',
   'followers_url': 'https://api.github.com/users/jreback/followers',
   'following_url': 'https://api.github.com/users/jreback/following{/other_user}',
   'gists_url': 'https://api.github.com/users/jreback/gists{/gist_id}',
   'starred_url': 'https://api.github.com/users/jreback/starred{/owner}{/repo}',
   'subscriptions_url': 'https://api.github.com/users/jreback/subscriptions',
   'organizations_url': 'https://api.github.com/users/jreback/orgs',
   'repos_url': 'https://api.github.com/users/jreback/repos',
   'events_url': 'https://api.github.com/users/jreback/events{/privacy}',
   'received_events_url': 'https://api.github.com/users/jreback/received_events',
   'type': 'User',
   'site_admin': False},
  'open_issues': 1245,
  'closed_issues': 379,
  'state': 'open',
  'created_at': '2015-01-13T10:53:19Z',
  'updated_at': '2019-05-14T06:00:58Z',
  'due_on': '2020-12-31T08:00:00Z',
  'closed_at': None},
 'comments': 0,
 'created_at': '2019-05-14T06:00:42Z',
 'updated_at': '2019-05-14T06:00:58Z',
 'closed_at': None,
 'author_association': 'MEMBER',
 'body': "Was looking to consolidate nth, first and last in the GroupBy world but was hitting some issues with categorical tests and handling of missing data. Note that the following calls are not equivalent, though they should be:\r\n\r\n```python\r\n>>> import numpy as np\r\n>>> import pandas as pd\r\n\r\n>>> s1 = pd.Categorical([np.nan, 'a', np.nan, 'a'], categories=['a', 'b', 'c'])\r\n>>> s2 = pd.Series([1, 2, 3, 4])\r\n>>> df = pd.DataFrame({'s1': s1, 's2': s2})\r\n>>> grp = df.groupby('s1', observed=False)\r\n>>> grp.first()\r\n     s2\r\ns1\r\na   2.0\r\nb   NaN\r\nc   NaN\r\n\r\n>>> grp.nth(0)\r\n    s2\r\ns1\r\na    2\r\n```\r\n"}

In [108]:
issues = pd.DataFrame(data, columns=['number', 'title', 
                                    'labels', 'state'])
issues

,number,title,labels,state
0,26386,CLN: Cleanup code in parsers.pyx,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
1,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
2,26384,Remove Deprecated Azure CI Step,[],open
3,26383,Prefixed batch script commands with call,[],open
4,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 211840, 'node_id': 'MDU6TGFiZWwyMTE4ND...",open
5,26380,ENH: Implementing NEP 18's __array_function__,[],open
6,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
8,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
9,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
10,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
11,26370,Feature requests: pandas.DataFrame.quantile wi...,[],open
12,26368,corrwith in 0.24 is much slower than 0.23 (esp...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
13,26367,Pandas import breaks when setting filterwarnings,[],open
14,26366,Fix type annotations for pandas.core.indexes.d...,[],open
15,26362,BUG: DataFrame.join on tz aware index and column,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,26360,New benchmarks for parsing dates with dayfirst...,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
17,26359,BUG: groupby.agg returns incorrect results for...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,26356,BUG: Exception when frame constructed from dic...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,26355,BUG: Fix MultiIndex DataFrame to_csv() segfault,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
20,26354,[ENH] ExtensionArray.argsort places the missin...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
21,26353,Add na_filter documentation to read_excel,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
22,26349,BUG: Instantiating DataFrames using dicts with...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,26345,Windows 3.7 CI Failures,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
24,26344,CI: Use bash for Windows scripts on Azure,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
25,26336,Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
26,26335,Left join on column with timezone aware index ...,"[{'id': 60458168, 'node_id': 'MDU6TGFiZWw2MDQ1...",open
27,26333,REGR: assigning scalar with a length no longer...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
28,26329,FutureWarning difficult to identify source,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
29,26328,Robustness improvement for normalize.py,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open

In [110]:
import sqlite3

In [111]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""